In [1]:
import numpy as np
import pandas as pd

In [2]:
t_df = pd.read_csv('./titanic_data.csv')

In [3]:
t_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
survived_sex = t_df.groupby("Pclass")['Age']

In [45]:
survived_sex.describe()

        count       mean        std   min   25%   50%   75%   max
Pclass
1       186.0  38.233441  14.802856  0.92  27.0  37.0  49.0  80.0
2       173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0
3       355.0  25.140620  12.495398  0.42  18.0  24.0  32.0  74.0

In [17]:
t_df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [10]:
t_df.sum()['Survived']

342

In [11]:
cnt_m = 0
cnt_fm = 0
for i in survived_sex[1]:
    if t_df.iloc[i]['Sex'] == 'male':
        cnt_m += 1
    if t_df.iloc[i]['Sex'] == 'female':
        cnt_fm += 1

print(cnt_m, cnt_fm)

109 233

In [12]:
surv_to20 = 0
surv_to30 = 0
surv_to40 = 0
surv_to50 = 0
surv_51upper = 0

for i in survived_sex[1]:
    if t_df.iloc[i]['Age'] <= 20:
        surv_to20 += 1
    elif t_df.iloc[i]['Age'] <= 30:
        surv_to30 += 1
    elif t_df.iloc[i]['Age'] <= 40:
        surv_to40 += 1
    elif t_df.iloc[i]['Age'] <= 50:
        surv_to50 += 1
    else:
        surv_51upper += 1

print(surv_to20,surv_to30,surv_to40,surv_to50,surv_51upper)

82 84 69 33 74

In [13]:
dead_to20 =0
dead_to30 =0
dead_to40 =0
dead_to50 =0
dead_51upper =0

for i in survived_sex[0]:
    if t_df.iloc[i]['Age'] <= 20:
        dead_to20 += 1
    elif t_df.iloc[i]['Age'] <= 30:
        dead_to30 += 1
    elif t_df.iloc[i]['Age'] <= 40:
        dead_to40 += 1
    elif t_df.iloc[i]['Age'] <= 50:
        dead_to50 += 1
    else:
        dead_51upper += 1

In [14]:
dead_to20,dead_to30,dead_to40,dead_to50,dead_51upper

(97, 146, 86, 53, 167)

In [15]:
print(surv_to20/dead_to20, surv_to30/dead_to30, surv_to40/dead_to40, surv_to50/dead_to50, surv_51upper/dead_51upper)

0.845360824742268 0.5753424657534246 0.8023255813953488 0.6226415094339622 0.4431137724550898